Revit 2027 API
AnalyticalLink.IsAutoGenerated Method
 Specifies whether or not an AnalyticalLink was created by an Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAutoGenerated()
Public Function IsAutoGenerated As Boolean
public:
bool IsAutoGenerated()
member IsAutoGenerated : unit -> bool
Return Value
Boolean
 True if AnalyticalLink was created by an Analytical Element, false otherwise.
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace